Revit 2027 API
Metal.MetalFinish Property
 The property labeled "Finish" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetalFinish { get; }
Public Shared ReadOnly Property MetalFinish As String
	Get
public:
static property String^ MetalFinish {
	String^ get ();
}
static member MetalFinish : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalFinishType".
See Also
Reference
Metal Class
Autodesk.Revit.DB.Visual Namespace